
## :white_check_mark: Apply Succeeded

[CI link](https://github.com/NaokiYazawa/aws-ecs-terraform/actions/runs/3813139440)



<pre><code>Apply complete! Resources: 2 added, 0 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
Acquiring state lock. This may take a few moments...
module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-089be32b53ed93a44]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-04569be9cc5bcc498]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0987943897935233f]
aws_lb_target_group.target_group: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:761817748648:targetgroup/go-simple-server-target-group/8afa1aa532757fb2]
aws_security_group.alb: Refreshing state... [id=sg-063dfdb42dc033bce]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0a4fcc6d5cb800c01]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0c1dce4975135cf8b]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-012beb5fcb619b0c2]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0a0c6669630006012]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-096a25608f5b80071]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0667441fb811d1d62]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-08f97f54831d3942d]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-034d6d26fe71ea68f]
module.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-091d85cb66945c032]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0d135d080dd37e251]
aws_lb.alb: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:761817748648:loadbalancer/app/go-simple-server-alb/1e1884b0df6efa30]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0ecb9a2a63a31e7e9]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-073b879e0fec67ce4]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-034d6d26fe71ea68f1080289494]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0e1193eb6f82459ec]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0a74d238845291c01]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0c1dce4975135cf8b1080289494]
module.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-012beb5fcb619b0c21080289494]
aws_lb_listener.alb_listener: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:761817748648:listener/app/go-simple-server-alb/1e1884b0df6efa30/c0028cfbd8873f18]
aws_lb_listener_rule.alb_listener_rule: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:761817748648:listener-rule/app/go-simple-server-alb/1e1884b0df6efa30/c0028cfbd8873f18/5a85275c312eb69a]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_ecr_lifecycle_policy.ecr_lifecycle_policy will be created
  + resource "aws_ecr_lifecycle_policy" "ecr_lifecycle_policy" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Expire images older than 14 days"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber = 14
                          + countType   = "sinceImagePushed"
                          + countUnit   = "days"
                          + tagStatus   = "untagged"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "go-simple-server"
    }

  # aws_ecr_repository.ecr_repository will be created
  + resource "aws_ecr_repository" "ecr_repository" {
      + arn                  = (known after apply)
      + force_delete         = true
      + id                   = (known after apply)
      + image_tag_mutability = "IMMUTABLE"
      + name                 = "go-simple-server"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = (known after apply)

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.
aws_ecr_repository.ecr_repository: Creating...
aws_ecr_repository.ecr_repository: Creation complete after 1s [id=go-simple-server]
aws_ecr_lifecycle_policy.ecr_lifecycle_policy: Creating...
aws_ecr_lifecycle_policy.ecr_lifecycle_policy: Creation complete after 0s [id=go-simple-server]
Releasing state lock. This may take a few moments...

Apply complete! Resources: 2 added, 0 changed, 0 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":8,"Program":"tfcmt","SHA1":"c0e39e1e84ae046b1025a021320e7478331b5141","Vars":{},"WorkflowName":"Terraform"} -->